app/controllers/shares_controller.rb

  def destroy
    @share = Share.find(params[:id])
    @share.destroy
---
DELETE FROM "shares" WHERE "id" = 1