app/controllers/shares_controller.rb

  def index
    per_page = 15
    page = params[:page] || 1
    @q = params[:q]
    order = "created_at DESC"
    timeThen = Time.now.advance(:years => -1)
   @shares = Share.search :page => page, :per_page => per_page, :order => order, :match_mode => :all, :conditions =>{:active => true, :updated_at => timeThen..Time.now }
---
SELECT * FROM "shares" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "shares"

  def show
    page = params[:page] || 1
    per_page = 10
    condition = true
    order = "created_at DESC"
    @share = Share.find(params[:id], :conditions => {:active => true}, :include => :tags)
---
SELECT * FROM `shares` WHERE (`shares`.`id` = 1)

  def edit
    @share = Share.find(params[:id])
---
SELECT * FROM "shares" WHERE ("shares"."id" = 7)

  def create
    @share = Share.new(params[:share])

    respond_to do |format|
      if @share.save
---
INSERT INTO "shares" ("updated_at", "license", "title", "alternative_contact", "website", "description", "link", "user_id", "source", "active", "created_at") VALUES('2009-04-16 06:31:26', 'bumper', 'baby', NULL, 'buggies', 'Niobium is a chemical element with symbol Nb and atomic number 41. A rare, soft, grey, ductile transition metal, niobium is found in the minerals pyrochlore (the main source for niobium) and columbite. Niobium has similar physical and chemical properties to another element, tantalum, and the two are therefore difficult to distinguish. The German chemist Heinrich Rose determined in 1846 that tantalum ores contain a second element, which he named niobium, after Niobe from Greek mythology. It was not until the early 20th century that niobium was first used commercially. Brazil is the leading producer of ', 'Blue', NULL, 'blue', 't', '2009-04-16 06:31:26')

  def update
    @share = Share.find(params[:id])

    respond_to do |format|
      if @share.update_attributes(params[:share])
---
SELECT * FROM "shares" WHERE ("shares"."id" = 7)
UPDATE "shares" SET "description" = 'Individuals use torrents to legitimately distribute art and information; yet, it’s difficult to find non-copyrighted material amongst the haystack of copyrighted data on places like The Pirate Bay. It isn’t that Open Art isn’t there, but that you have to work to discover it. On Sharearchy, we can share what we find.', "updated_at" = '2009-03-23 10:27:02' WHERE "id" = 7

  def destroy
    @share = Share.find(params[:id])
---
SELECT * FROM "shares" WHERE ("shares"."id" = 1)