app/controllers/users_controller.rb

INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "profile", "current_login_ip", "password_salt", "current_login_at", "website", "persistence_token", "login_count", "login", "email_address", "active", "last_login_ip", "created_at") VALUES(NULL, NULL, '2009-03-12 09:30:32', '7dddbd382f1e340f15bcef8e780a08e47e93373cf08ccc72cb844ad0f778168e730bef2476d532b1efd0a50fdcb16d00018a85cda30eacc1a431c3e7b881393f', 'I created this site.', NULL, '39e099f15910adc40068da133c66a6f2b9fa81aecfc7379c40fe4b927cb5bb50bbc0bd32a384183ff861b0aee9045d74e8d304dd6d805a705bec5897461e3592', NULL, 'http://sharearchy.com', '16793ee75f35f5b0f7382f75f5404000b77c7e218fdd15dd8db537944485f19c22c9c513a951d75c3ff4b6e073930508fc0024dc6c889dd967b2327b37d7d171', NULL, 'Galen', 'galenmail@gmail.com', NULL, NULL, '2009-03-12 09:30:32')
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT count(*) AS count_all FROM "users" WHERE (last_request_at > '2009-03-23 10:05:10')
---
  def show

    begin
     #@user = User.find_by_login(params[:login]) || User.find(params[:id]) || current_user

    @user = params[:id] ? User.find(params[:id]) : current_user

    rescue Exception => e
      flash[:notice] = 'That user doesn\'t exist.'
      redirect_to root_url
    else
      if @user.present?

        page = params[:page] || 1
        per_page = 10
        order = "created_at DESC"

        @truncate = true
        @paginate = true

        if request.path.include?("profile") or (request.path.include?("profile") and request.format == "rss")
           @stories = @user.stories.active.page(page).per(per_page).order(order)

UPDATE "users" SET "website" = 'Brilliant.org', "email_address" = 'here@there.it', "profile" = 'this and that', "updated_at" = '2009-03-18 11:43:49' WHERE "id" = 2
---
  def update
    @user = current_user # makes our views "cleaner" and more consistent

    useful_params = user_params
    useful_params = user_params.except(:password, :password_confirmation) if params[:password].blank?

    if @user.update_attributes(useful_params)